Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkSymbol.Shape Property
 The shape of the section mark symbol.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkBase.SectionMarkSymbol.SymbolShapes Shape { get; set; }
Public Property Shape As SectionMarkBase.SectionMarkSymbol.SymbolShapes
	Get
	Set
Property Value
Type: SectionMarkBase.SectionMarkSymbol.SymbolShapes
See Also
Reference
SectionMarkBase.SectionMarkSymbol Class
Tekla.Structures.Drawing Namespace